{
  "quests": [
    {
      "id": 1,
      "name": "The End of Everything Quest",
      "steps": [
        { "step": 1, "hint": "Where snow falls eternal, stone hands grasp at emptiness. Three must break before the broken reveals itself.", "task": "Break open three hand statues" },
        { "step": 2, "hint": "The broken thing knows not wholeness. Seek where metal and flame are forged beneath the banner of industry.", "task": "Restore Broken Spell at Hiisi Base Anvil" },
        { "step": 3, "hint": "Four watchers stand in silence, each marking a path. Their stillness speaks of spaces between spaces.", "task": "Triangulate Portal Location and Use Summon Portal" }
      ]
    },
    {
      "id": 2,
      "name": "The Cessation Quest",
      "steps": [
        { "step": 1, "hint": "Four temples float, yet one stands empty.", "task": "Obtain Potion of Mimicium from Barren Temple" },
        { "step": 2, "hint": "Beyond the tree tops, another temple floats. The glyph shows ten embraced by hearts. In the empty temple where you first learned of mimicry, words were written. Perhaps they speak of what comes next.", "task": "Awaken Ten Potion Mimics at Henkevä Temple" },
        { "step": 3, "hint": "Where sky reflects in water, a chamber waits. Perhaps it hungers for what you can create.", "task": "Fill Ominous Temple Chamber with Ominous Liquid" },
        { "step": 4, "hint": "The cycle turns. Return to where you began. What was empty remembers what it could be.", "task": "Return to Barren Temple and Cast Touch of Grass on Temple Surface" },
        { "step": 5, "hint": "Where ancient stone reaches skyward, an island house stands out. Within its walls, living water.", "task": "Obtain Urine" },
        { "step": 6, "hint": "What was empty remembers. Perhaps it hungers for what flows from within.", "task": "Apply Urine to Divine Ground" },
        { "step": 7, "hint": "The cycle completes, yet a temple floats in silence, with ancient bones far below.", "task": "Locate Kivi Temple (Optional)" }
      ]
    },
    {
      "id": 3,
      "name": "Sun Quest (Uusi Aurinko)",
      "steps": [
        { "step": 1, "hint": "When vision shifts and worlds blur, seek where earth cracks open. Stone growth marks hidden paths.", "task": "Reveal Fungal Altar Map at Stone Mushroom Structure" },
        { "step": 2, "hint": "Five places appear where none were before. But to commune with them requires an eye that sees truth. Where fungus grows in caverns, a teacher waits. The glyph on the altar guides the way.", "task": "Obtain Paha Silmä - Evil Eye" },
        { "step": 3, "hint": "With altered sight and the eye of truth, approach the marked places. They may respond. Above the desert chasm, where brickwork stands, another altar floats. The teacher there speaks of awakening.", "task": "Visit Fungal Altar - Fungal Caverns" },
        { "step": 4, "hint": "First words speak of soil's secret. Four more teachers await - one floats above desert, others hide in dangerous places. Where machines hum with power, deep within that place, a third teacher waits. It speaks of where sun first shone.", "task": "Visit Fungal Altar - Desert Chasm" },
        { "step": 5, "hint": "Second words speak of sun and ancient pinnacles. Three teachers remain - seek where power hums with machines. Within the vault where treasure sleeps, seek the altar. The teacher there speaks of where new sun rises.", "task": "Visit Fungal Altar - Power Plant" },
        { "step": 6, "hint": "Third words speak of where sun first shone. Two teachers remain - one guards treasure in a vault. Where fungus grows wild and untamed, in the overgrown cavern, the final teacher waits. It speaks of returning to the beginning.", "task": "Visit Fungal Altar - The Vault" },
        { "step": 7, "hint": "Fourth words speak of where new sun rises. One teacher remains - where fungus grows wild and untamed. Above the desert chasm, where brickwork stands, words were spoken of ancient pinnacles and awakening. Remember what was said.", "task": "Visit Fungal Altar - Overgrown Cavern" },
        { "step": 8, "hint": "Fifth words complete the circle - return to beginning. The path is known. Dig deep in soil where the seed of promise sleeps.", "task": "Find Auringonsiemen - Sun Seed" },
        { "step": 9, "hint": "The seed sleeps in earth's depths. Perhaps it dreams of sunlight. Perhaps it needs to wake where ancients built toward sky.", "task": "Bring Seed to Pyramid and Awaken It" },
        { "step": 10, "hint": "The seed stirs, becomes young. But youth knows hunger. Four elements form all things - perhaps they must be consumed.", "task": "Obtain Essence of Earth" },
        { "step": 11, "hint": "One element claimed. Three remain - where wind never ceases.", "task": "Obtain Essence of Air" },
        { "step": 12, "hint": "Two elements held. Two remain - where flame knows no end.", "task": "Obtain Essence of Fire" },
        { "step": 13, "hint": "Three elements bound. One remains - where water dwells in deepest places.", "task": "Obtain Essence of Water" },
        { "step": 14, "hint": "Four elements complete. Pour their terrible power into the youngling, and watch it transform.", "task": "Imbue Youngling with All Four Essences" },
        { "step": 15, "hint": "An egg is born. It hungers for life itself - one hundred souls must feed it before the stone emerges.", "task": "Allow Egg to Consume Life Force of 100 Foes" },
        { "step": 16, "hint": "One hundred souls consumed. The egg hardens into stone. Now subject it to great heat, then carry it to where the first sun shone. Where machines hum with power, words were spoken of where sun first shone. Remember what was written.", "task": "Subject Stone to Great Fire and Heat" },
        { "step": 17, "hint": "Fire has tempered it. Now ascend far above, where the original sun once touched this earth.", "task": "Bring Stone to Original Sun Location" },
        { "step": 18, "hint": "Bathed in original light. Now descend to deepest depths, where the new sun waits to rise. Within the vault where treasure sleeps, words were spoken of where new sun rises. Remember what was written.", "task": "Bring Stone to New Sun Location" },
        { "step": 19, "hint": "Two lights have touched it. The final lesson awaits - return to where you first found the sleeping seed.", "task": "Return Stone to Origin and Complete the Cycle" }
      ]
    },
    {
      "id": 4,
      "name": "Fish Quest",
      "steps": [
        { "step": 1, "hint": "Above the mountain where you began, a stone awaits an offering from below. Give it a creature of water, and rain shall answer. From bone shall come power, and from bone and song shall come the sea that drowns even masters.", "task": "Obtain a Fish" },
        { "step": 2, "hint": "A swimmer caught. Carry it upward to the altar floating above your first mountain.", "task": "Transport Fish to Mountain Altar and Place It" },
        { "step": 3, "hint": "When the sky gives back what was given, something remains. Bone where there was none.", "task": "Complete Fish Rain Event" },
        { "step": 4, "hint": "Bone in hand. Where metal meets flame, things change. Perhaps the bone remembers what it could be.", "task": "Transport Hauen Leukaluu to Hiisi Base Anvil and Place It" },
        { "step": 5, "hint": "The spell is learned. But bone can sing. Perhaps strings and bone together make something new.", "task": "Obtain Kantele" },
        { "step": 6, "hint": "Strings found. But to merge them with bone, you need bone again. The altar remembers.", "task": "Obtain Second Hauen Leukaluu - If Needed" },
        { "step": 7, "hint": "Second bone obtained. Perhaps bone and strings together create something neither could alone.", "task": "Transport Both Items to Anvil and Place Them" },
        { "step": 8, "hint": "The sea waits in your hand. Below, where wizards gather, a master dwells. Perhaps he needs to hear the song.", "task": "Transport to Master of Masters and Use Sea of Swamp to Drown Him" },
        { "step": 9, "hint": "When the master falls, something changes. Perhaps wands remember who commands them.", "task": "Defeat Master of Masters" }
      ]
    },
    {
      "id": 5,
      "name": "The Coral Crystal Key Quest",
      "steps": [
        { "step": 1, "hint": "Where ancient knowledge sleeps, guarded by one who has mastered the highest art, a key waits. Seek an abandoned laboratory where experiments still whisper.", "task": "Defeat High Alchemist" },
        { "step": 2, "hint": "The key is voiceless without a tune.", "task": "Charge Key at Pond Music Machine" },
        { "step": 3, "hint": "The key has heard one song. Three more places sing. Perhaps where trees reach skyward.", "task": "Charge Key at Tree Music Machine" },
        { "step": 4, "hint": "Two songs learned. Two more await. Perhaps where ice and water meet, where stone rises from water.", "task": "Charge Key at Island Music Machine" },
        { "step": 5, "hint": "Three songs known. One remains. Perhaps where sun beats down, where ancient stone sleeps.", "task": "Charge Key at Desert Music Machine" },
        { "step": 6, "hint": "The key sings full now. The book speaks of a home in sky, beyond invisible steps. Perhaps coral waits there. In the western sky, where gourd brings refreshment, a cave holds words. The book speaks of homes - one in sky, one below.", "task": "Transport Key to Eastern Cloudscape and Unlock Coral Chest" }
      ]
    },
    {
      "id": 6,
      "name": "The Dark Crystal Key Quest",
      "steps": [
        { "step": 1, "hint": "Where ancient knowledge sleeps, guarded by one who has mastered the highest art, a key waits. Seek an abandoned laboratory where experiments still whisper.", "task": "Defeat High Alchemist" },
        { "step": 2, "hint": "Key in hand. Seek the notebook hidden where fungus overtakes stone. In the western sky, where gourd brings refreshment, a note waits. It speaks of locked research and understanding.", "task": "Locate and Read Alchemist's Notebook" },
        { "step": 3, "hint": "Melodies known. Seek first the strings hidden in the great tree.", "task": "Obtain Kantele" },
        { "step": 4, "hint": "Strings found. Now seek wind - in the western sky where gourd brings refreshment.", "task": "Obtain Huilu - Ocarina" },
        { "step": 5, "hint": "Notes mastered. Set key upon ground and play the string melody first.", "task": "Learn Note Spells" },
        { "step": 6, "hint": "The key responds, but something is missing. Perhaps another melody completes it. Perhaps wind must join strings.", "task": "Play First Melody - Kantele - to Crystal Key" },
        { "step": 7, "hint": "The key whispers now. Two songs have changed it. The book speaks of a home below, beneath seas of fire. In the western sky, where gourd brings refreshment, a book waits. It speaks of homes - one in sky, one below, beneath seas of fire.", "task": "Play Second Melody - Huilu - to Crystal Key" },
        { "step": 8, "hint": "Below all things, fire burns. Perhaps a chest waits there, dark mirror to the one above.", "task": "Transport Empowered Key to The Work - Hell - and Unlock Dark Chest" }
      ]
    }
  ]
}
